{
  "day": 4,
  "topic": "Will and Shall ",
  "sections": [
    {
      "title": "Introduction",
      "content": "Welcome to Unit 21 of our English learning journey. In this unit, we'll explore the use of 'will' and 'shall'"
    },
    {
      "title": "Definition",
      "content": "for expressing future actions and intentions. Let's delve into the key concepts."
    },
    {
      "title": "'Will' Future Actions",
      "content": "Use 'will' to express future actions, predictions, and intentions.",
      "points": [
        "I will call you tomorrow",
        "He will probably arrive by noon."
      ]
    },   
    {
        "title": "'Shall' Suggestions",
        "content": "Use 'shall' to make suggestions or offers, primarily in British English",
        "points": [
          "Shall we go to the cinema?",
          "I shall help you with your homework."
        ]
      },   
    {
      "title": "Examples",
      "content": "Let's examine examples to illustrate the application of 'will' and 'shall':",
      "points": [
        "She will graduate next year",
        "Shall I bring some snacks to the party?",
        "They will visit us during the summer"
      ]
    },    
    {
      "title": "Exercise - Possession Comparison",
      "content": "Write sentences comparing possession using both 'have' and 'have got' For example:",
      "points": [
        "I have a bike, but my brother has got a motorcycle."
      ]
    },
    {
      "title": "Common Mistakes",
      "content": "Address common mistakes related to the interchangeable use of 'will' and 'shall' in various contexts.",
      "points": [
        "Incorrect:Shall I call you later?",
        "Correct: 'Shall' is appropriate for making suggestions or offers"
      ]
    },
    {
      "title": "Recap and Summary:",
      "content": "In summary, 'will' and 'shall' are used for expressing future actions and making suggestions or offers. Pay attention to the context and formality."
    },
    {
      "title": "Additional Resources:",
      "content": "For additional practice and reinforcement, consider exploring examples in language learning books and online exercises."
    },
    {
      "title": "Conclusion",
      "content": "Thank you for joining today's lesson on 'will and Shall' Practice using these modal verbs for future expressions, and feel free to reach out if you have any questions. Happy learning!"
    }
  ]
}