{
    "day": 4,
    "topic": "Will and Shall ",
    "sections": [
        {
            "title": "Introduction",
            "content": "Welcome to Unit 26 of our English learning journey. In this unit, we'll explore the use of 'can', 'could,' and '(be) able to'"
        },
        {
            "title": "Definition",
            "content": "' to express ability, capability, and possibility. Let's delve into the key concepts."
        },
        {
            "title": "'Can' for Present Ability:",
            "content": "Use 'can' to express present ability or capability",
            "points": [
                "I can swim",
                "She can speak three languages"
            ]
        },
        {
            "title": "Could' for Past Ability",
            "content": "Use 'could' to express past ability or capability",
            "points": [
                "When I was a child, I could climb trees",
                "He could play the piano when he was younger"
            ]
        },
        {
            "title": "'(Be) Able To' for General Ability",
            "content": "Use '(be) able to' for both present and past situations to express general ability.",
            "points": [
                "I am able to solve complex problems",
                "She was able to finish the project on time."
            ]
        },
        {
            "title": "Examples",
            "content": "Address common mistakes related to the confusion between 'can' ,'could' and '(be) able to' in different contexts.",
            "points": [
                "He can play the guitar very well.",
                "Could you help me with this heavy box?",
                "Despite the challenges, she was able to complete the task"
            ]
        },      
        {
            "title": "Common Mistakes",
            "content": "Address common mistakes related to the interchangeable use of 'will' and 'shall' in various contexts.",
            "points": [
                "Incorrect:I was can swim when I was a child",
                "Correct: 'I could swim when I was a child"
            ]
        },
        {
            "title": "Recap and Summary:",
            "content": "In summary, 'can', 'could' and '(be) able to' are used to express ability and capability in various contexts. Pay attention to the time frame and formality."
        },
        {
            "title": "Additional Resources:",
            "content": "For additional practice and reinforcement, consider exploring examples in language learning books and online exercises."
        },
        {
            "title": "Conclusion",
            "content": "Thank you for joining today's lesson on 'Can, Could, and (Be) Able To.' Practice using these expressions to convey ability confidently, and feel free to reach out if you have any questions. Happy learning!"
        }
    ]
}